ext/wmf-civicrm/tests/phpunit/Civi/WMFQueue/data/payments-init.json

{
  "contribution_tracking_id": "12345",
  "gateway": "testgateway",
  "order_id": "",
  "gateway_txn_id": "",
  "validation_action": "process",
  "payments_final_status": "complete",
  "payment_method": "paypal",
  "payment_submethod": "",
  "country": "IT",
  "amount": "2.00",
  "currency": "EUR",
  "server": "test-payments1002",
  "date": "1445990999"
}
